---
kind: type
id: T:Autodesk.Revit.DB.LinkConversionData
source: html/2d05cfbb-8386-d1c6-b751-fe6f57dc2b63.htm
---
# Autodesk.Revit.DB.LinkConversionData

This class contains the information necessary to re-create a Revit document
 from an external source.

## Syntax (C#)
```csharp
public class LinkConversionData : IDisposable
```